Rails-Backend/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        render :json => Category.all