Rails-Backend/app/controllers/parts_controller.rb

    def index
        render :json => Part.all, :include => [:pc, :category]
---
SELECT "categories".* FROM "categories"
SELECT "parts".* FROM "parts"